#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/blog/blog/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/blog/blog

To view this run in a browser, visit:
https://app.terraform.io/app/do-it-simple/kocoblo/runs/run-xXuvpxa4YGBgxdyA

Waiting for the plan to start...

Terraform v1.0.2
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_s3_bucket.bucket: Refreshing state... [id=kocoblo-lambda]
aws_api_gateway_rest_api.api_gateway: Refreshing state... [id=5icv8s3xrl]
aws_iam_role.lambda_role: Refreshing state... [id=kocoblo-lambda]
aws_api_gateway_resource.api_gateway_resource: Refreshing state... [id=xn478t]
aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-5icv8s3xrl-xn478t-ANY]
aws_api_gateway_method_response.response: Refreshing state... [id=agmr-5icv8s3xrl-xn478t-ANY-200]
aws_s3_bucket_object.lambda_code: Refreshing state... [id=form.zip]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_iam_role.lambda_role has been changed
  ~ resource "aws_iam_role" "lambda_role" {
        id                    = "kocoblo-lambda"
        name                  = "kocoblo-lambda"
      + tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # aws_api_gateway_method.api_gateway_method has been changed
  ~ resource "aws_api_gateway_method" "api_gateway_method" {
      + authorization_scopes = []
        id                   = "agm-5icv8s3xrl-xn478t-ANY"
      + request_models       = {}
      + request_parameters   = {}
        # (5 unchanged attributes hidden)
    }
  # aws_s3_bucket.bucket has been changed
  ~ resource "aws_s3_bucket" "bucket" {
        id                          = "kocoblo-lambda"
      + tags                        = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # aws_s3_bucket_object.lambda_code has been changed
  ~ resource "aws_s3_bucket_object" "lambda_code" {
        id                 = "form.zip"
      + metadata           = {}
      + tags               = {}
        # (10 unchanged attributes hidden)
    }
  # aws_api_gateway_rest_api.api_gateway has been changed
  ~ resource "aws_api_gateway_rest_api" "api_gateway" {
        id                           = "5icv8s3xrl"
        name                         = "kocoblo-api-gateway"
      + tags                         = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_deployment.api_gateway_deployment will be created
  + resource "aws_api_gateway_deployment" "api_gateway_deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "5icv8s3xrl"
      + stage_name    = "prod"
    }

  # aws_api_gateway_integration.api_gateway_integration will be created
  + resource "aws_api_gateway_integration" "api_gateway_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "ANY"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "xn478t"
      + rest_api_id             = "5icv8s3xrl"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_integration_response.integration_response will be created
  + resource "aws_api_gateway_integration_response" "integration_response" {
      + http_method         = "ANY"
      + id                  = (known after apply)
      + resource_id         = "xn478t"
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET, POST'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = "5icv8s3xrl"
      + status_code         = "200"
    }

  # aws_lambda_function.form_lambda will be created
  + resource "aws_lambda_function" "form_lambda" {
      + arn                            = (known after apply)
      + function_name                  = "SendGridForm"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::776733965771:role/kocoblo-lambda"
      + runtime                        = "nodejs14.x"
      + s3_bucket                      = "kocoblo-lambda"
      + s3_key                         = "form.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "SENDGRID_API_KEY"          = (sensitive)
              + "SENDGRID_AUTHORIZED_EMAIL" = (sensitive)
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.lambda_permission will be created
  + resource "aws_lambda_permission" "lambda_permission" {
      + action        = "lambda:InvokeFunction"
      + function_name = "SendGridForm"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = "arn:aws:execute-api:us-east-1:776733965771:5icv8s3xrl/*/POST/form"
      + statement_id  = "AllowLambdaInvocation"
    }

  # aws_s3_bucket_object.lambda_code will be updated in-place
  ~ resource "aws_s3_bucket_object" "lambda_code" {
      ~ etag               = "d92325777cd02bc35d88fdce7f5e0a72" -> "WjkVFyV3aw9i76ngwxGc4u7KyKFDq2b/hmQ07QcD0Ao="
        id                 = "form.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 0 to destroy.


```

</details>

*Pusher: @kokiebisu, Action: `pull_request`*